TIREPD_RTS/Test/IRU.RTS.TIREPD.B2G.CipherHelper/Properties/Settings.settings

<?xml version='1.0' encoding='utf-8'?>
<SettingsFile xmlns="http://schemas.microsoft.com/VisualStudio/2004/01/settings" CurrentProfile="(Default)" GeneratedClassNamespace="IRU.RTS.TIREPD.B2G.CipherHelper.Properties" GeneratedClassName="Settings">
  <Profiles />
  <Settings>
    <Setting Name="Empty2BGRequest" Type="System.String" Scope="Application">
      <Value Profile="(Default)">&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
  &lt;soap:Body&gt;
    &lt;TIREPDB2G xmlns="http://www.iru.org"&gt;
      &lt;su&gt;
        &lt;SubscriberID&gt;&lt;/SubscriberID&gt;
        &lt;CertificateID&gt;&lt;/CertificateID&gt;
        &lt;ESessionKey&gt;&lt;/ESessionKey&gt;
        &lt;SubscriberMessageID&gt;&lt;/SubscriberMessageID&gt;
        &lt;InformationExchangeVersion&gt;&lt;/InformationExchangeVersion&gt;
        &lt;MessageName&gt;&lt;/MessageName&gt;
        &lt;TimeSent&gt;&lt;/TimeSent&gt;
        &lt;MessageContent&gt;&lt;/MessageContent&gt;
      &lt;/su&gt;
    &lt;/TIREPDB2G&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</Value>
    </Setting>
  </Settings>
</SettingsFile>